src/cf/Enums/РазделыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РазделыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщикамиИПокупателями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПрочимиКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРазделы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоНалогам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкиТоваровДляУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСФондамиПоСтраховымВзносам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервыТоваровОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкидкиБонусы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РазделыУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Принадлежность регистров разделам учета
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ОбъектМетаданныхРегистрНакопления
//   * Значение - ПеречислениеСсылка.РазделыУчета
Функция ПринадлежностьРегистровНакопления() Экспорт
	
	Результат = Новый Соответствие;
	Результат[Метаданные.РегистрыНакопления.ДвиженияСерииНоменклатуры] = Запасы;
	Результат[Метаданные.РегистрыНакопления.Запасы] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыВРазрезеГТД] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыИАгентскиеУслугиПринятые] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыНаСкладах] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыПереданные] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыПереданныеВРазрезеГТД] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ЗапасыПринятыеВРазрезеГТД] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ПартииТоваров] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ПотребностьВЗапасах] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ПрослеживаемыеТовары] = Запасы;
	Результат[Метаданные.РегистрыНакопления.СерииНоменклатуры] = Запасы;
	Результат[Метаданные.РегистрыНакопления.ДенежныеСредства] = ДенежныеСредства;
	Результат[Метаданные.РегистрыНакопления.ДоходыИРасходыКассовыйМетод] = РасчетыСПоставщикамиИПокупателями;
	Результат[Метаданные.РегистрыНакопления.ДоходыИРасходыНераспределенные] = РасчетыСПоставщикамиИПокупателями;
	Результат[Метаданные.РегистрыНакопления.ДоходыИРасходыОтложенные] = РасчетыСПоставщикамиИПокупателями;
	Результат[Метаданные.РегистрыНакопления.РасчетыСПоставщиками] = РасчетыСПоставщикамиИПокупателями;
	Результат[Метаданные.РегистрыНакопления.РасчетыСПокупателями] = РасчетыСПоставщикамиИПокупателями;
	Результат[Метаданные.РегистрыНакопления.РасчетыСПодотчетниками] = РасчетыСПодотчетниками;
	Результат[Метаданные.РегистрыНакопления.РасчетыСПрочимиКонтрагентами] = РасчетыСПрочимиКонтрагентами;
	Результат[Метаданные.РегистрыНакопления.РасчетыСПерсоналом] = РасчетыСПерсоналом;
	Результат[Метаданные.РегистрыНакопления.ВнеоборотныеАктивы] = Имущество;
	Результат[Метаданные.РегистрыНакопления.ВыработкаВнеоборотныхАктивов] = Имущество;
	Результат[Метаданные.РегистрыНакопления.РасчетыПоНалогам] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.РасчетыПоЭквайрингу] = Эквайринг;
	Результат[Метаданные.РегистрыНакопления.ЗакупкиДляКУДиР] = ЗакупкиТоваровДляУСН;
	Результат[Метаданные.РегистрыНакопления.ПартииТоваровДляКУДиР] = ЗакупкиТоваровДляУСН;
	Результат[Метаданные.РегистрыНакопления.ПартииТоваровУСН] = ЗакупкиТоваровДляУСН;
	Результат[Метаданные.РегистрыНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ] = РасчетыСФондамиПоСтраховымВзносам;
	Результат[Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций] = РезервыТоваровОрганизаций;
	Результат[Метаданные.РегистрыНакопления.РасчетыПоКредитамИЗаймам] = РасчетыПоКредитамИЗаймам;
	Результат[Метаданные.РегистрыНакопления.БонусныеБаллы] = СкидкиБонусы;
	Результат[Метаданные.РегистрыНакопления.ПодарочныеСертификаты] = СкидкиБонусы;
	Результат[Метаданные.РегистрыНакопления.ПродажиПоДисконтнымКартам] = СкидкиБонусы;
	Результат[Метаданные.РегистрыНакопления.НДСАвансыВыданные] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСАвансыПоДоговорамКомиссии] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСАвансыПолученные] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСЗаписиКнигиПродаж] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСЗаписиРаздела7Декларации] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСПредъявленный] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСПредъявленныйРеализация0] = РасчетыПоНалогам;
	Результат[Метаданные.РегистрыНакопления.НДСРеализация0] = РасчетыПоНалогам;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
